RU09342/lab-6taking-control-over-your-embedded-life-teammartin/Open Loop Systems/MSP430G2553/main.c
#include <msp430g2553.h>
#include <stdio.h>

//Closed Loop

/*** Initialize UART-Related Code ***/
volatile unsigned int current = 0; // store the currently read ADC10MEM at the beginning of the loop.
volatile unsigned int timer_count = 0;
static char data;
char buffer[32];
char buffer2[32];
void init_uart();
void init_timer();
void UARTSendArray(unsigned char *TxArray, unsigned char ArrayLength);

void init_uart() 
{
	P1SEL  = BIT1 + BIT2;	// P1.1 = RXD, P1.2 = TXD
	P1SEL2 = BIT1 + BIT2;	// P1.1 = RXD, P1.2 = TXD
	UCA0CTL1 |= UCSSEL_2;	// SMCLK
	UCA0BR0 = 104;			// see baud rate divider above
	UCA0BR1 = 0;
	UCA0MCTL = UCBRS0;		// modulation UCBRSx = 1
	UCA0CTL1 &= ~UCSWRST;	// ** initialize USCI state machine **
	IE2 |= UCA0TXIE;		// Enable USCI_A0 TX interrupt
}

void UARTSendArray(unsigned char *TxArray, unsigned char ArrayLength) 
{
    while(ArrayLength--) { // Loop until StringLength == 0 and post decrement
        while(!(IFG2 & UCA0TXIFG)); // Wait for TX buffer to be ready for new data
        
        UCA0TXBUF = *TxArray; //Write the character at the location specified py the pointer
        TxArray++; //Increment the TxString pointer to point to the next character
    }
}

void init_timer() 
{
	TA1CTL |= TACLR;		// reset timer
	TA1CTL  = TASSEL_2		// SMCLK
			+ ID_0			// input divider = 1
			+ MC_2;			// continuous mode, interrupt disabled
	TA1CCTL0 = OUTMOD_2		// compare mode
			+ CCIE			// interrupt enabled
			+ CCIFG;
			
	/*** Timer0_A Set-Up ***/
    DCOCTL = 0;							// Select lowest DCO settings
	BCSCTL1 = CALBC1_1MHZ;				// Set DCO to 1 MHz
	DCOCTL = CALDCO_1MHZ;
    TA0CTL |= TASSEL_2 | MC_1 | ID_3;
    TA0CCR0 |= 800;
    TA0CCTL1 |= OUTMOD_7;
    TA0CCR1 |= 0;
}

int main(void)
{
    WDTCTL = WDTPW + WDTHOLD;                 // Stop WDT
    init_uart();
    init_timer();

    /*** GPIO Set-Up ***/
    P1DIR |= BIT6; // PWM output
    P1SEL |= BIT6;
    P2DIR |= BIT0 + BIT1 + BIT3 + BIT4;

    /*** ADC10 Set-Up ***/
    ADC10CTL0 = SREF_0 + ADC10SHT_3 + ADC10ON + ADC10IE + REFON; // ADC10ON, interrupt enabled
    ADC10CTL1 = INCH_3 + SHS_0 + ADC10DIV_3 + ADC10SSEL_3 + CONSEQ_0;	// clock source = SMCLK
    ADC10AE0 |= BIT0;                         // PA.1 ADC option select
    
    unsigned int a = 0, delay = 50000, sec = 0;
    for (;;)
    {
        ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
        __bis_SR_register(CPUOFF + GIE);        // LPM0, ADC10_ISR will force exit
		current = ADC10MEM;
        
        a = 0; sec = 0;                         // Delays to remove LED flickering
        while (a < delay) { a++; }
        while ((a >= delay) && (sec < 10)) { a = 0; sec++; }
        
        if (current < 350) {
            P2OUT &= ~BIT4; P2OUT &= ~BIT3; P2OUT &= ~BIT1; P2OUT &= ~BIT0; // 0000
            TA0CCR1 = 0;    //TA0CCR1 = ADC10MEM;
        }
        if ((current >= 350) && (current < 370)) {
            P2OUT &= ~BIT4; P2OUT &= ~BIT3; P2OUT &= ~BIT1; P2OUT |= BIT0; // 0001
            TA0CCR1 = 100;
        }
        if((current >= 370) && (current < 390)) {
            P2OUT &= ~BIT4; P2OUT &= ~BIT3; P2OUT |= BIT1; P2OUT &= ~BIT0; // 0010
            TA0CCR1 = 150;
        }
        if((current >= 390) && (current < 410)) {
            P2OUT &= ~BIT4; P2OUT &= ~BIT3; P2OUT |= BIT1; P2OUT |= BIT0; // 0011
            TA0CCR1 = 200;
        }
        if((current >= 410) && (current < 430)) {
            P2OUT &= ~BIT4; P2OUT |= BIT3; P2OUT &= ~BIT1; P2OUT &= ~BIT0; // 0100
            TA0CCR1 = 250;
        }
        if((current >= 430) && (current < 450)) {
            P2OUT &= ~BIT4; P2OUT |= BIT3; P2OUT &= ~BIT1; P2OUT |= BIT0; // 0101
            TA0CCR1 = 300;
        }
        if((current >= 450) && (current < 470)) {
            P2OUT &= ~BIT4; P2OUT |= BIT3; P2OUT |= BIT1; P2OUT &= ~BIT0; // 0110
            TA0CCR1 = 350;
        }
        if((current >= 470) && (current < 490)) {
            P2OUT &= ~BIT4; P2OUT |= BIT3; P2OUT |= BIT1; P2OUT |= BIT0; // 0111
            TA0CCR1 = 400;
        }
        if((current >= 490) && (current < 510)) {
            P2OUT |= BIT4; P2OUT &= ~BIT3; P2OUT &= ~BIT1; P2OUT &= ~BIT0; // 1000
            TA0CCR1 = 450;
        }
        if((current >= 510) && (current < 530)) {
            P2OUT |= BIT4; P2OUT &= ~BIT3; P2OUT &= ~BIT1; P2OUT |= BIT0; // 1001
            TA0CCR1 = 500;
        }
        if((current >= 530) && (current < 550)) {
            P2OUT |= BIT4; P2OUT &= ~BIT3; P2OUT |= BIT1; P2OUT &= ~BIT0; // 1010
            TA0CCR1 = 550;
        }
        if((current >= 550) && (current < 570)) {
            P2OUT |= BIT4; P2OUT &= ~BIT3; P2OUT |= BIT1; P2OUT |= BIT0; // 1011
            TA0CCR1 = 600;
        }
        if((current >= 570) && (current < 590)) {
            P2OUT |= BIT4; P2OUT |= BIT3; P2OUT &= ~BIT1; P2OUT &= ~BIT0; // 1100
            TA0CCR1 = 650;
        }
        if((current >= 590) && (current < 610)) {
            P2OUT |= BIT4; P2OUT |= BIT3; P2OUT &= ~BIT1; P2OUT |= BIT0; // 1101
            TA0CCR1 = 700;
        }
        if((current >= 610) && (current < 630)) {
            P2OUT |= BIT4; P2OUT |= BIT3; P2OUT |= BIT1; P2OUT &= ~BIT0; // 1110
            TA0CCR1 = 750;
        }
        if(current >= 630) {
            P2OUT |= BIT4; P2OUT |= BIT3; P2OUT |= BIT1; P2OUT |= BIT0; // 1111
            TA0CCR1 = 800;
        }
    }
}

#pragma vector=ADC10_VECTOR // ADC10 interrupt service routine
__interrupt void ADC10_ISR(void)
{
    __bic_SR_register_on_exit(CPUOFF);        // Clear CPUOFF bit from 0(SR)
}

// INTERRUPT HANDLERS
#pragma vector = TIMER1_A0_VECTOR
__interrupt void Timer1_A0(void) 
{
	timer_count++;
	if (timer_count > 4) { //default is 16 for 1 second refresh rate. set to 16 for slower data transfer
		timer_count = 0;
		ADC10SA = (unsigned) &current; // store latest ADC value into address
		IE2 |= UCA0TXIE; // activate TX interrupt
	}
}

#pragma vector = USCIAB0TX_VECTOR
__interrupt void USCI0TX_ISR(void) 
{
    //P1DIR = 0x01;
	//P1OUT ^= 0x01; //red led
	
	unsigned int i = 0;					// iterator pointers
	sprintf(buffer, "ADCval: %d \n\r", (int)(current)); //output text to PC
	while (buffer[i] != '\0') {
		while (!(IFG2 & UCA0TXIFG));	// USCI_A0 TX buffer ready?
		UCA0TXBUF = buffer[i++];
	}
	unsigned int j = 0;					// iterator pointers
	sprintf(buffer2, "current: %d \n\r", (int)(current)); //output text to PC
	while (buffer2[j] != '\0') {
		while (!(IFG2 & UCA0TXIFG));	// USCI_A0 TX buffer ready?
		UCA0TXBUF = buffer2[j++];
	}
	IE2 &= ~UCA0TXIFG; // reset interrupt flag
}
